app/controllers/pages_controller.rb

SELECT  "banners".* FROM "banners" ORDER BY "banners"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "abandas".* FROM "abandas" WHERE "abandas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "agendas".* FROM "agendas" WHERE (event_date >= '2017-05-23')
SELECT  "photos".* FROM "photos" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 15]]
---
  def home
    @banner = Banner.all
    @abanda = Abanda.find(1)
    @agendas = Agenda.where('event_date >= ?', Date.today)
    @photos = Photo.all.limit('15').order("RANDOM()")